using UnityEngine;
using UnityEngine.Tilemaps;

public class RandomMapGenerator : MonoBehaviour
{
    public Tilemap tilemap;
    public Floor Floors;

    void Start()
    {

    }

    void Update()
    {

    }

    //맵을 세팅하는 함수
    void SetMap()
    {

    }

    //층별 리스트 생성 함수
    void ShuffleFloorXY()
    {

    }
}

/*
 *  [맵 배치 구현 방식 설계]
 *   0. 해당 층의 범위(타일을 깔 좌표 범위) 가져오기
 *      0.1. 해당 층의 범위 내의 모든 타일 좌표(x, y)를 층별 리스트에 넣기. (미리 만들기 X, 섞고 빼고 하기 때문에 어차피 매번 새로 만들어야 함.)
 *   1. 광물의 최소/최대치를 가져온 후 랜덤값 뽑기 (이번 일차에 나올 해당 광물의 수)
 *   2. 뽑은 랜덤값만큼 for문을 돌려 광물 랜덤배치.
 *      2.1. 위에서 만든 리스트를 Pop하여 광물 배치.
 *       ㄴ> 큐가 아닌 스택으로 취급할 것. 선입선출인 큐의 경우 한번 사용할 때 마다 전부 한 칸씩 밀어야 하지만, 선입후출인 스택의 경우 같은 효과를 내면서도 효율적임.
 *      2.2. 해당 층의 모든 광물의 배치가 끝날 때 까지 1~2를 반복할 것.
 *   3. 층 광물 배치가 끝났다면, 리스트 안이 빌 때 까지 좌표를 꺼내와 (남은 것을 전부 꺼내와) 기본타일(흙)으로 배치할 것.
 *   4. 이를 모든 층이 배치될 때 까지 반복.
 *  
 *  [필요한 별도 함수(가독성 향상 & 재사용성 증가를 위해)]
 *   - 1~5층의 가로세로값을 가져와 층별 좌표를 리스트에 전부 넣은 후 섞어서 랜덤 순서로 만드는 함수. (기존 리스트가 있다면 아예 삭제하고 새로 만들 것.)
 *   ㄴ> 미리 크기를 알 수 있기 때문에 동적배열로 생성해 메모리 재할당을 막을 것.
*/
